cask_args appdir: '/Applications'

# packages that other installs depend on
cask 'xquartz'

# use GNU coreutils
# $PATH is modified in $ZDOTDIR/env_config.zsh to make linux/mac consistent
brew 'coreutils'
brew 'diffutils'
brew 'moreutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'
brew 'gnu-getopt'

# install newer version of otherwise ancient software
brew 'bash'
brew 'gpatch'
brew 'git'
brew 'less'
brew 'openssh'
brew 'python'
brew 'rsync'
brew 'vim'
brew 'zsh'

# generic installs
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'automake'
brew 'yadm'
brew 'bash-completion'
brew 'cask'
brew 'htop'
brew 'quazip'
brew 'nmap'
brew 'npm'
brew 'node'
brew 'nvm'
brew 'elixir'
brew 'ack'
brew 'grc'
brew 'imagemagick'
brew 'figlet'
brew 'libcaca'
brew 'openssl'
brew 'libmagic' # for pistol
brew 'choose-gui' # rofi replacement; used in ~/.local/scripts/cross-platform/picker
brew 'readline'
brew 'trash'
brew 'mas'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'tmux'
brew 'python3'
brew 'rlwrap'
brew 'ffmpeg'
brew 'ffmpegthumbnailer'
brew 'hub'
brew 'graphviz'  # for sqleton
brew 'thefuck'
brew 'php'
brew 'ytop'
brew 'mysql'
brew 'p7zip' # 7zip
brew 'todo-txt'
brew 'duti'
brew 'pyenv'
brew 'rdfind'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'shfmt'
brew 'composer'
brew 'dart'
brew 'rust'
brew 'shellcheck'
brew 'neovim'
brew 'fzf'
brew 'exa'
brew 'ccls'
brew 'checkbashisms'
brew 'cmake'
brew 'docker-compose'
brew 'docker-compose-completion'
brew 'golang'
brew 'xonsh'
brew 'bat'
brew 'boxes'
brew 'glow'
brew 'chafa'
brew 'datamash'
brew 'entr'
brew 'fd'
brew 'gh'
brew 'highlight'
brew 'hyperfine'
brew 'jq'
brew 'lolcat'
brew 'lynx'
brew 'ncdu'
brew 'pandoc'
brew 'pastel'
brew 'exiftool'
brew 'qrencode'
brew 'ripgrep'
brew 'sc-im'
brew 'socat'
brew 'the_silver_searcher'
brew 'unar'
brew 'haskell-stack'
brew 'koekeishiya/formulae/skhd'
brew 'syncthing'

# zsh
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# fonts
cask 'font-source-code-pro'
cask 'font-hack-nerd-font'

# Applications
cask 'alfred'         # spotlight replacement
cask 'alacritty'
cask 'kitty'
cask 'chromedriver'   # for webscraping
cask 'mysqlworkbench' # easy mysql interface
cask 'adoptopenjdk/openjdk/adoptopenjdk8'  # java
cask 'zoom'         # for stupid video confrencing
cask 'visual-studio-code'
cask 'microsoft-teams'
cask 'steam'          # video games
cask 'gimp'           # image editing
cask 'mpv'            # media player
cask 'docker'                # for the docker daemon
cask 'daisydisk'             # visualizes volumes
cask 'balenaetcher'          # for USB boot drive creation
cask 'keepassxc'             # password manager
cask 'db-browser-for-sqlite' # sqlite3 GUI
cask 'cyberduck'             # file transfers

## Browsers
cask 'google-chrome'
cask 'firefox-developer-edition'
cask 'tor-browser'

## Games
cask 'minecraft'
cask 'openemu'

# Mac App Store installations
